Los análisis más interesantes procederán de datos combinados de más de un origen. Por ello pandas proporciona varios métodos para combinar conjuntos de datos y facilitar este trabajo necesario

**pandas.merge** conecta filas de objetos *Dataframe* en función de una o varias claves

**pandas.concat** concatena o "apla" objetos a lo largo de un eje

**combine_first** Permite unir datos superpuestos para rellenar los valores que faltan en un objeto con los valores de otro.

**merge** realiza varios tipos de combinaciones de uno a uno, de varios a uno y de varios a varios

# uno a uno

In [2]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Gary', 'Stu', 'Mary', 'Sue'],
                    'group': ['Accounting', 'Marketing', 'Marketing', 'HR']})
print(df1)
df2 = pd.DataFrame({'employee': ['Mary', 'Stu', 'Gary', 'Sue'],
                    'hire_date': [2008, 2012, 2017, 2018]})
print(df2)

  employee       group
0     Gary  Accounting
1      Stu   Marketing
2     Mary   Marketing
3      Sue          HR
  employee  hire_date
0     Mary       2008
1      Stu       2012
2     Gary       2017
3      Sue       2018

In [4]:
df3=pd.merge(df1,df2)
print(df3)

  employee       group  hire_date
0     Gary  Accounting       2017
1      Stu   Marketing       2012
2     Mary   Marketing       2008
3      Sue          HR       2018

# Varios a uno

Similar a uno a uno pero una de las dos columbas de clave contienen entradas duplicadas. El DataFrame conservará las entradas duplicadas según corresponda.

In [5]:
df4 = pd.DataFrame({'group': ['Accounting', 'Marketing', 'HR'],
                    'supervisor': ['Carlos', 'Giada', 'Stephanie']})
df4

        group supervisor
0  Accounting     Carlos
1   Marketing      Giada
2          HR  Stephanie

In [7]:
pd.merge(df3, df4, on='group')

  employee       group  hire_date supervisor
0     Gary  Accounting       2017     Carlos
1      Stu   Marketing       2012      Giada
2     Mary   Marketing       2008      Giada
3      Sue          HR       2018  Stephanie

# Combinaciones de varios a varios
Si las dos columnas de clave de dos objetos DataFrames que se vana  combinar continene dupplicados se genera una combinacion de varios a varios

In [8]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Marketing', 'Marketing', 'HR', 'HR'],
                    'core_skills': ['math', 'spreadsheets', 'writing', 'communication',
                               'spreadsheets', 'organization']})
df5

        group    core_skills
0  Accounting           math
1  Accounting   spreadsheets
2   Marketing        writing
3   Marketing  communication
4          HR   spreadsheets
5          HR   organization

In [9]:
pd.merge(df1, df5, on='group')

  employee       group    core_skills
0     Gary  Accounting           math
1     Gary  Accounting   spreadsheets
2      Stu   Marketing        writing
3      Stu   Marketing  communication
4     Mary   Marketing        writing
5     Mary   Marketing  communication
6      Sue          HR   spreadsheets
7      Sue          HR   organization

# Left_on and Right_on

Imagina que usa un conjunto de datos en el que el nombre del empleado tiene la etiqueta name en lugar de employee, para ello se utilizan left_on y right_on para especificar los nombre de columna por los que se va a realizar la combinacion

In [12]:
df6 = pd.DataFrame({'name': ['Gary', 'Stu', 'Mary', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1)
print(df6)

  employee       group
0     Gary  Accounting
1      Stu   Marketing
2     Mary   Marketing
3      Sue          HR
   name  salary
0  Gary   70000
1   Stu   80000
2  Mary  120000
3   Sue   90000

In [11]:
pd.merge(df1, df6, left_on="employee", right_on="name")

  employee       group  name  salary
0     Gary  Accounting  Gary   70000
1      Stu   Marketing   Stu   80000
2     Mary   Marketing  Mary  120000
3      Sue          HR   Sue   90000

In [17]:
pd.merge(df1,df6,left_on='employee',right_on='name').drop(['name'],axis=1)

  employee       group  salary
0     Gary  Accounting   70000
1      Stu   Marketing   80000
2     Mary   Marketing  120000
3      Sue          HR   90000

# left_index and Right_index

En ocaciones resulta más sencillo combinar por índice que por columna. 

left_index y right_index permiten combinar por índice.

In [20]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a)
print(df2a)

               group
employee
Gary      Accounting
Stu        Marketing
Mary       Marketing
Sue               HR
          hire_date
employee
Mary           2008
Stu            2012
Gary           2017
Sue            2018

In [23]:


pd.merge(df1a, df2a, left_index=True, right_index=True)

               group  hire_date
employee
Gary      Accounting       2017
Stu        Marketing       2012
Mary       Marketing       2008
Sue               HR       2018

# Join para dataframes combina por indices de forma predeterminada

In [24]:
df1a.join(df2a)

               group  hire_date
employee
Gary      Accounting       2017
Stu        Marketing       2012
Mary       Marketing       2008
Sue               HR       2018

In [25]:
# Combinacion de letf_index/right_index con left_on/right_on
pd.merge(df1a, df6, left_index=True, right_on='name')

        group  name  salary
0  Accounting  Gary   70000
1   Marketing   Stu   80000
2   Marketing  Mary  120000
3          HR   Sue   90000

# Aritmetica de conjuntos para las combinaciones
La aritmetia de conjuntos que se usa para la combinacion

In [3]:
df5 = pd.DataFrame({'group': ['Engineering', 'Marketing', 'Sales'],
                    'core_skills': ['math', 'writing', 'communication']})
df5

         group    core_skills
0  Engineering           math
1    Marketing        writing
2        Sales  communication

In [4]:
pd.merge(df1, df5, on='group') # se obtiene la intersepciond e los dos objetos Dataframes.

  employee      group core_skills
0      Stu  Marketing     writing
1     Mary  Marketing     writing

In [5]:
pd.merge(df1, df5, on='group', how='inner')

  employee      group core_skills
0      Stu  Marketing     writing
1     Mary  Marketing     writing

In [6]:
pd.merge(df1,df5,on='group',how='outer')

  employee        group    core_skills
0     Gary   Accounting            NaN
1      Stu    Marketing        writing
2     Mary    Marketing        writing
3      Sue           HR            NaN
4      NaN  Engineering           math
5      NaN        Sales  communication

In [7]:
#Como join left de sql
pd.merge(df1, df5, how='left')

  employee       group core_skills
0     Gary  Accounting         NaN
1      Stu   Marketing     writing
2     Mary   Marketing     writing
3      Sue          HR         NaN

In [8]:
#como join right de sql#Cada nombre de columba en un df debe ser unico, cuando se repiten pandas agrega _x o _y por defecto
pd.merge(df1, df5, how='right')

  employee        group    core_skills
0      NaN  Engineering           math
1      Stu    Marketing        writing
2     Mary    Marketing        writing
3      NaN        Sales  communication

In [10]:

df7 = pd.DataFrame({'name': ['Gary', 'Stu', 'Mary', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df8 = pd.DataFrame({'name': ['Gary', 'Stu', 'Mary', 'Sue'],
                    'rank': [3, 1, 4, 2]})
pd.merge(df7, df8, on='name')

   name  rank_x  rank_y
0  Gary       1       3
1   Stu       2       1
2  Mary       3       4
3   Sue       4       2

# Concatenación en Numpy

La concatenación en pandas se genera mediante la concatenación para matrices de Numpy.

In [11]:
import numpy as np
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [12]:
x = [[1, 2],
[3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

# Concatenación en pandas

pandas ofrece pd.concat() similar a np.concatenate()

In [13]:
ser1 = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
ser2 = pd.Series(['d', 'e', 'f'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [15]:
df9 = pd.DataFrame({'A': ['a', 'c'],
                    'B': ['b', 'd']})
pd.concat([df9, df9])

   A  B
0  a  b
1  c  d
0  a  b
1  c  d

In [16]:
pd.concat([df9, df9], ignore_index=True)

   A  B
0  a  b
1  c  d
2  a  b
3  c  d

# Concatenacion con combinaciones

In [18]:
df10 = pd.DataFrame({'A': ['a', 'd'],
                     'B': ['b', 'e'],
                     'C': ['c', 'f']})
df10

   A  B  C
0  a  b  c
1  d  e  f

In [19]:
df11 = pd.DataFrame({'B': ['u', 'x'],
                     'C': ['v', 'y'],
                     'D': ['w', 'z']})
df11

   B  C  D
0  u  v  w
1  x  y  z

In [20]:
pd.concat([df10, df11])

     A  B  C    D
0    a  b  c  NaN
1    d  e  f  NaN
0  NaN  u  v    w
1  NaN  x  y    z

In [17]:
pd.concat([df9, df9], axis=1)

   A  B  A  B
0  a  b  a  b
1  c  d  c  d

# append()

In [21]:
df9.append(df9)

   A  B
0  a  b
1  c  d
0  a  b
1  c  d